----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv3d-1       [-1, 32, 30, 32, 32]           4,736
       BatchNorm3d-2       [-1, 32, 30, 32, 32]              64
              ReLU-3       [-1, 32, 30, 32, 32]               0
         Dropout3d-4       [-1, 32, 30, 32, 32]               0
            Conv3d-5       [-1, 64, 15, 16, 16]          55,296
       BatchNorm3d-6       [-1, 64, 15, 16, 16]             128
         Dropout3d-7       [-1, 64, 15, 16, 16]               0
            Conv3d-8       [-1, 64, 15, 16, 16]         110,592
       BatchNorm3d-9       [-1, 64, 15, 16, 16]             128
AdaptiveAvgPool3d-10         [-1, 64, 15, 1, 1]               0
           Conv3d-11         [-1, 16, 15, 1, 1]           1,040
             ReLU-12         [-1, 16, 15, 1, 1]               0
           Conv3d-13         [-1, 64, 15, 1, 1]           1,088
          Sigmoid-14         [-1, 64, 15, 1, 1]               0
AdaptiveAvgPool3d-15        [-1, 64, 1, 16, 16]               0
           Conv3d-16        [-1, 16, 1, 16, 16]           1,040
             ReLU-17        [-1, 16, 1, 16, 16]               0
           Conv3d-18        [-1, 64, 1, 16, 16]           1,088
          Sigmoid-19        [-1, 64, 1, 16, 16]               0
AdaptiveAvgPool3d-20          [-1, 64, 1, 1, 1]               0
           Conv3d-21          [-1, 16, 1, 1, 1]           1,040
             ReLU-22          [-1, 16, 1, 1, 1]               0
           Conv3d-23          [-1, 64, 1, 1, 1]           1,088
          Sigmoid-24          [-1, 64, 1, 1, 1]               0
SpatioTemporalAttention-25       [-1, 64, 15, 16, 16]               0
           Conv3d-26       [-1, 64, 15, 16, 16]           2,048
      BatchNorm3d-27       [-1, 64, 15, 16, 16]             128
ResidualAttentionBlock3D-28       [-1, 64, 15, 16, 16]               0
           Conv3d-29       [-1, 64, 15, 16, 16]         110,592
      BatchNorm3d-30       [-1, 64, 15, 16, 16]             128
        Dropout3d-31       [-1, 64, 15, 16, 16]               0
           Conv3d-32       [-1, 64, 15, 16, 16]         110,592
      BatchNorm3d-33       [-1, 64, 15, 16, 16]             128
AdaptiveAvgPool3d-34         [-1, 64, 15, 1, 1]               0
           Conv3d-35         [-1, 16, 15, 1, 1]           1,040
             ReLU-36         [-1, 16, 15, 1, 1]               0
           Conv3d-37         [-1, 64, 15, 1, 1]           1,088
          Sigmoid-38         [-1, 64, 15, 1, 1]               0
AdaptiveAvgPool3d-39        [-1, 64, 1, 16, 16]               0
           Conv3d-40        [-1, 16, 1, 16, 16]           1,040
             ReLU-41        [-1, 16, 1, 16, 16]               0
           Conv3d-42        [-1, 64, 1, 16, 16]           1,088
          Sigmoid-43        [-1, 64, 1, 16, 16]               0
AdaptiveAvgPool3d-44          [-1, 64, 1, 1, 1]               0
           Conv3d-45          [-1, 16, 1, 1, 1]           1,040
             ReLU-46          [-1, 16, 1, 1, 1]               0
           Conv3d-47          [-1, 64, 1, 1, 1]           1,088
          Sigmoid-48          [-1, 64, 1, 1, 1]               0
SpatioTemporalAttention-49       [-1, 64, 15, 16, 16]               0
ResidualAttentionBlock3D-50       [-1, 64, 15, 16, 16]               0
           Conv3d-51         [-1, 128, 8, 8, 8]         221,184
      BatchNorm3d-52         [-1, 128, 8, 8, 8]             256
        Dropout3d-53         [-1, 128, 8, 8, 8]               0
           Conv3d-54         [-1, 128, 8, 8, 8]         442,368
      BatchNorm3d-55         [-1, 128, 8, 8, 8]             256
AdaptiveAvgPool3d-56         [-1, 128, 8, 1, 1]               0
           Conv3d-57          [-1, 32, 8, 1, 1]           4,128
             ReLU-58          [-1, 32, 8, 1, 1]               0
           Conv3d-59         [-1, 128, 8, 1, 1]           4,224
          Sigmoid-60         [-1, 128, 8, 1, 1]               0
AdaptiveAvgPool3d-61         [-1, 128, 1, 8, 8]               0
           Conv3d-62          [-1, 32, 1, 8, 8]           4,128
             ReLU-63          [-1, 32, 1, 8, 8]               0
           Conv3d-64         [-1, 128, 1, 8, 8]           4,224
          Sigmoid-65         [-1, 128, 1, 8, 8]               0
AdaptiveAvgPool3d-66         [-1, 128, 1, 1, 1]               0
           Conv3d-67          [-1, 32, 1, 1, 1]           4,128
             ReLU-68          [-1, 32, 1, 1, 1]               0
           Conv3d-69         [-1, 128, 1, 1, 1]           4,224
          Sigmoid-70         [-1, 128, 1, 1, 1]               0
SpatioTemporalAttention-71         [-1, 128, 8, 8, 8]               0
           Conv3d-72         [-1, 128, 8, 8, 8]           8,192
      BatchNorm3d-73         [-1, 128, 8, 8, 8]             256
ResidualAttentionBlock3D-74         [-1, 128, 8, 8, 8]               0
           Conv3d-75         [-1, 128, 8, 8, 8]         442,368
      BatchNorm3d-76         [-1, 128, 8, 8, 8]             256
        Dropout3d-77         [-1, 128, 8, 8, 8]               0
           Conv3d-78         [-1, 128, 8, 8, 8]         442,368
      BatchNorm3d-79         [-1, 128, 8, 8, 8]             256
AdaptiveAvgPool3d-80         [-1, 128, 8, 1, 1]               0
           Conv3d-81          [-1, 32, 8, 1, 1]           4,128
             ReLU-82          [-1, 32, 8, 1, 1]               0
           Conv3d-83         [-1, 128, 8, 1, 1]           4,224
          Sigmoid-84         [-1, 128, 8, 1, 1]               0
AdaptiveAvgPool3d-85         [-1, 128, 1, 8, 8]               0
           Conv3d-86          [-1, 32, 1, 8, 8]           4,128
             ReLU-87          [-1, 32, 1, 8, 8]               0
           Conv3d-88         [-1, 128, 1, 8, 8]           4,224
          Sigmoid-89         [-1, 128, 1, 8, 8]               0
AdaptiveAvgPool3d-90         [-1, 128, 1, 1, 1]               0
           Conv3d-91          [-1, 32, 1, 1, 1]           4,128
             ReLU-92          [-1, 32, 1, 1, 1]               0
           Conv3d-93         [-1, 128, 1, 1, 1]           4,224
          Sigmoid-94         [-1, 128, 1, 1, 1]               0
SpatioTemporalAttention-95         [-1, 128, 8, 8, 8]               0
ResidualAttentionBlock3D-96         [-1, 128, 8, 8, 8]               0
           Conv3d-97         [-1, 256, 4, 4, 4]         884,736
      BatchNorm3d-98         [-1, 256, 4, 4, 4]             512
        Dropout3d-99         [-1, 256, 4, 4, 4]               0
          Conv3d-100         [-1, 256, 4, 4, 4]       1,769,472
     BatchNorm3d-101         [-1, 256, 4, 4, 4]             512
AdaptiveAvgPool3d-102         [-1, 256, 4, 1, 1]               0
          Conv3d-103          [-1, 64, 4, 1, 1]          16,448
            ReLU-104          [-1, 64, 4, 1, 1]               0
          Conv3d-105         [-1, 256, 4, 1, 1]          16,640
         Sigmoid-106         [-1, 256, 4, 1, 1]               0
AdaptiveAvgPool3d-107         [-1, 256, 1, 4, 4]               0
          Conv3d-108          [-1, 64, 1, 4, 4]          16,448
            ReLU-109          [-1, 64, 1, 4, 4]               0
          Conv3d-110         [-1, 256, 1, 4, 4]          16,640
         Sigmoid-111         [-1, 256, 1, 4, 4]               0
AdaptiveAvgPool3d-112         [-1, 256, 1, 1, 1]               0
          Conv3d-113          [-1, 64, 1, 1, 1]          16,448
            ReLU-114          [-1, 64, 1, 1, 1]               0
          Conv3d-115         [-1, 256, 1, 1, 1]          16,640
         Sigmoid-116         [-1, 256, 1, 1, 1]               0
SpatioTemporalAttention-117         [-1, 256, 4, 4, 4]               0
          Conv3d-118         [-1, 256, 4, 4, 4]          32,768
     BatchNorm3d-119         [-1, 256, 4, 4, 4]             512
ResidualAttentionBlock3D-120         [-1, 256, 4, 4, 4]               0
          Conv3d-121         [-1, 256, 4, 4, 4]       1,769,472
     BatchNorm3d-122         [-1, 256, 4, 4, 4]             512
       Dropout3d-123         [-1, 256, 4, 4, 4]               0
          Conv3d-124         [-1, 256, 4, 4, 4]       1,769,472
     BatchNorm3d-125         [-1, 256, 4, 4, 4]             512
AdaptiveAvgPool3d-126         [-1, 256, 4, 1, 1]               0
          Conv3d-127          [-1, 64, 4, 1, 1]          16,448
            ReLU-128          [-1, 64, 4, 1, 1]               0
          Conv3d-129         [-1, 256, 4, 1, 1]          16,640
         Sigmoid-130         [-1, 256, 4, 1, 1]               0
AdaptiveAvgPool3d-131         [-1, 256, 1, 4, 4]               0
          Conv3d-132          [-1, 64, 1, 4, 4]          16,448
            ReLU-133          [-1, 64, 1, 4, 4]               0
          Conv3d-134         [-1, 256, 1, 4, 4]          16,640
         Sigmoid-135         [-1, 256, 1, 4, 4]               0
AdaptiveAvgPool3d-136         [-1, 256, 1, 1, 1]               0
          Conv3d-137          [-1, 64, 1, 1, 1]          16,448
            ReLU-138          [-1, 64, 1, 1, 1]               0
          Conv3d-139         [-1, 256, 1, 1, 1]          16,640
         Sigmoid-140         [-1, 256, 1, 1, 1]               0
SpatioTemporalAttention-141         [-1, 256, 4, 4, 4]               0
ResidualAttentionBlock3D-142         [-1, 256, 4, 4, 4]               0
AdaptiveAvgPool3d-143         [-1, 256, 2, 2, 2]               0
       Dropout3d-144         [-1, 256, 2, 2, 2]               0
         Flatten-145                 [-1, 2048]               0
          Linear-146                  [-1, 512]       1,049,088
            ReLU-147                  [-1, 512]               0
         Dropout-148                  [-1, 512]               0
          Linear-149                  [-1, 256]         131,328
     BatchNorm1d-150                  [-1, 256]             512
          Linear-151                  [-1, 512]         131,584
            ReLU-152                  [-1, 512]               0
         Dropout-153                  [-1, 512]               0
          Linear-154                 [-1, 2048]       1,050,624
            ReLU-155                 [-1, 2048]               0
 ConvTranspose3d-156         [-1, 128, 3, 4, 4]       1,572,992
     BatchNorm3d-157         [-1, 128, 3, 4, 4]             256
            ReLU-158         [-1, 128, 3, 4, 4]               0
       Dropout3d-159         [-1, 128, 3, 4, 4]               0
 ConvTranspose3d-160          [-1, 64, 5, 8, 8]         393,280
     BatchNorm3d-161          [-1, 64, 5, 8, 8]             128
            ReLU-162          [-1, 64, 5, 8, 8]               0
       Dropout3d-163          [-1, 64, 5, 8, 8]               0
 ConvTranspose3d-164        [-1, 32, 9, 16, 16]          98,336
     BatchNorm3d-165        [-1, 32, 9, 16, 16]              64
            ReLU-166        [-1, 32, 9, 16, 16]               0
       Dropout3d-167        [-1, 32, 9, 16, 16]               0
 ConvTranspose3d-168         [-1, 1, 9, 31, 31]           4,705
         Sigmoid-169         [-1, 1, 9, 31, 31]               0
================================================================
Total params: 12,875,105
Trainable params: 12,875,105
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.47
Forward/backward pass size (MB): 75.02
Params size (MB): 49.11
Estimated Total Size (MB): 124.60
----------------------------------------------------------------
